app/views/articles/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 10]]
SELECT COUNT(*) FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 8]]
---
<h1><%= @article.title %></h1>
<% if @article.tags.size > 0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
<% # Only show comments if there are actually any
	if @article.comments.size > 0
%>
	<h3>Comments (<%= @article.comments.size %>)</h3>