app/views/tags/index.html.erb

				# linked to itself
				@articles = Article.all
---
SELECT "articles".* FROM "articles"

				@articles.each do |a|
					a.tags.each do |tmpTag|
---
SELECT "tags".* FROM "tags"