app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def show
		@article = Article.find(params[:id]);

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
	def destroy
		@article = Article.find(params[:id])
		flash.notice = "Article [#{@article.title}] was deleted."
		@article.destroy