app/controllers/tags_controller.rb

	def destroy
		@tag = Tag.find(params[:id])
		deletedTagName = @tag.name
		flash.notice = "The tag(#{deletedTagName}) was deleted."
		@tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 3]]